[NoCoverage] ArrowFunction
src/App.tsx:17:28
   const { data: seats = [], isLoading } = useSeatsQuery();
   useSeatStream();
 
-  const error = useUIStore((s) => s.error);
+  const error = useUIStore(() => undefined);
   const setError = useUIStore((s) => s.setError);
   const clearError = useUIStore((s) => s.clearError);

[NoCoverage] ArrowFunction
src/App.tsx:21:55
   const setError = useUIStore((s) => s.setError);
   const clearError = useUIStore((s) => s.clearError);
 
-  const holdMutation = useHoldSeatMutation({ onError: (e) => setError(e.message) });
+  const holdMutation = useHoldSeatMutation({ onError: () => undefined });
   const releaseMutation = useReleaseSeatMutation({ onError: (e) => setError(e.message) });
   const confirmMutation = useConfirmReservationMutation({ onError: (e) => setError(e.message) });

[NoCoverage] ArrowFunction
src/App.tsx:22:61
   const clearError = useUIStore((s) => s.clearError);
 
   const holdMutation = useHoldSeatMutation({ onError: (e) => setError(e.message) });
-  const releaseMutation = useReleaseSeatMutation({ onError: (e) => setError(e.message) });
+  const releaseMutation = useReleaseSeatMutation({ onError: () => undefined });
   const confirmMutation = useConfirmReservationMutation({ onError: (e) => setError(e.message) });
 

[NoCoverage] ArrowFunction
src/App.tsx:23:68
 
   const holdMutation = useHoldSeatMutation({ onError: (e) => setError(e.message) });
   const releaseMutation = useReleaseSeatMutation({ onError: (e) => setError(e.message) });
-  const confirmMutation = useConfirmReservationMutation({ onError: (e) => setError(e.message) });
+  const confirmMutation = useConfirmReservationMutation({ onError: () => undefined });
 
   const pendingSeatId = holdMutation.isPending

[NoCoverage] ObjectLiteral
src/App.tsx:23:57
 
   const holdMutation = useHoldSeatMutation({ onError: (e) => setError(e.message) });
   const releaseMutation = useReleaseSeatMutation({ onError: (e) => setError(e.message) });
-  const confirmMutation = useConfirmReservationMutation({ onError: (e) => setError(e.message) });
+  const confirmMutation = useConfirmReservationMutation({});
 
   const pendingSeatId = holdMutation.isPending

[NoCoverage] ArrowFunction
src/App.tsx:31:34
       ? releaseMutation.variables
       : undefined;
 
-  const heldCount = seats.filter((s) => s.heldByMe && s.status === 'HELD').length;
+  const heldCount = seats.filter(() => undefined).length;
   const maxSeatsReached = heldCount >= MAX_SEATS_PER_HOLD;
 

[NoCoverage] ConditionalExpression
src/App.tsx:31:55
       ? releaseMutation.variables
       : undefined;
 
-  const heldCount = seats.filter((s) => s.heldByMe && s.status === 'HELD').length;
+  const heldCount = seats.filter((s) => s.heldByMe && true).length;
   const maxSeatsReached = heldCount >= MAX_SEATS_PER_HOLD;
 

[NoCoverage] EqualityOperator
src/App.tsx:32:27
       : undefined;
 
   const heldCount = seats.filter((s) => s.heldByMe && s.status === 'HELD').length;
-  const maxSeatsReached = heldCount >= MAX_SEATS_PER_HOLD;
+  const maxSeatsReached = heldCount > MAX_SEATS_PER_HOLD;
 
   const handleHold = (seatId: number) => {

[NoCoverage] EqualityOperator
src/App.tsx:32:27
       : undefined;
 
   const heldCount = seats.filter((s) => s.heldByMe && s.status === 'HELD').length;
-  const maxSeatsReached = heldCount >= MAX_SEATS_PER_HOLD;
+  const maxSeatsReached = heldCount < MAX_SEATS_PER_HOLD;
 
   const handleHold = (seatId: number) => {

[NoCoverage] BlockStatement
src/App.tsx:34:42
   const heldCount = seats.filter((s) => s.heldByMe && s.status === 'HELD').length;
   const maxSeatsReached = heldCount >= MAX_SEATS_PER_HOLD;
 
-  const handleHold = (seatId: number) => {
-    if (maxSeatsReached) {
-      setError(`You can only hold up to ${MAX_SEATS_PER_HOLD} seats`);
-      return;
-    }
-    holdMutation.mutate(seatId);
-  };
+  const handleHold = (seatId: number) => {};
 
   const handleRelease = (seatId: number) => {

[NoCoverage] ConditionalExpression
src/App.tsx:35:9
   const maxSeatsReached = heldCount >= MAX_SEATS_PER_HOLD;
 
   const handleHold = (seatId: number) => {
-    if (maxSeatsReached) {
+    if (false) {
       setError(`You can only hold up to ${MAX_SEATS_PER_HOLD} seats`);
       return;

[NoCoverage] ConditionalExpression
src/App.tsx:35:9
   const maxSeatsReached = heldCount >= MAX_SEATS_PER_HOLD;
 
   const handleHold = (seatId: number) => {
-    if (maxSeatsReached) {
+    if (true) {
       setError(`You can only hold up to ${MAX_SEATS_PER_HOLD} seats`);
       return;

[NoCoverage] BlockStatement
src/App.tsx:42:45
     holdMutation.mutate(seatId);
   };
 
-  const handleRelease = (seatId: number) => {
-    releaseMutation.mutate(seatId);
-  };
+  const handleRelease = (seatId: number) => {};
 
   const handleConfirm = () => {

[NoCoverage] BlockStatement
src/App.tsx:46:31
     releaseMutation.mutate(seatId);
   };
 
-  const handleConfirm = () => {
-    const heldSeats = seats.filter((s) => s.heldByMe && s.status === 'HELD').map((s) => s.id);
-    if (heldSeats.length === 0) {
-      setError('Please select at least one seat');
-      return;
-    }
-    confirmMutation.mutate(heldSeats);
-  };
+  const handleConfirm = () => {};
 
   if (isLoading) {

[NoCoverage] ConditionalExpression
src/App.tsx:47:43
   };
 
   const handleConfirm = () => {
-    const heldSeats = seats.filter((s) => s.heldByMe && s.status === 'HELD').map((s) => s.id);
+    const heldSeats = seats.filter((s) => true).map((s) => s.id);
     if (heldSeats.length === 0) {
       setError('Please select at least one seat');

[NoCoverage] MethodExpression
src/App.tsx:47:23
   };
 
   const handleConfirm = () => {
-    const heldSeats = seats.filter((s) => s.heldByMe && s.status === 'HELD').map((s) => s.id);
+    const heldSeats = seats.map((s) => s.id);
     if (heldSeats.length === 0) {
       setError('Please select at least one seat');

[NoCoverage] BlockStatement
src/App.tsx:48:33
 
   const handleConfirm = () => {
     const heldSeats = seats.filter((s) => s.heldByMe && s.status === 'HELD').map((s) => s.id);
-    if (heldSeats.length === 0) {
-      setError('Please select at least one seat');
-      return;
-    }
+    if (heldSeats.length === 0) {}
     confirmMutation.mutate(heldSeats);
   };

[NoCoverage] EqualityOperator
src/App.tsx:48:9
 
   const handleConfirm = () => {
     const heldSeats = seats.filter((s) => s.heldByMe && s.status === 'HELD').map((s) => s.id);
-    if (heldSeats.length === 0) {
+    if (heldSeats.length !== 0) {
       setError('Please select at least one seat');
       return;

[NoCoverage] BlockStatement
src/App.tsx:55:18
     confirmMutation.mutate(heldSeats);
   };
 
-  if (isLoading) {
-    return (
-      <Box className={styles.page}>
-        <Box sx={{ display: 'flex', justifyContent: 'center', alignItems: 'center', height: '100vh' }}>
-          <CircularProgress sx={{ color: 'primary.main' }} />
-        </Box>
-      </Box>
-    );
-  }
+  if (isLoading) {}
 
   return (

[NoCoverage] StringLiteral
src/App.tsx:58:29
   if (isLoading) {
     return (
       <Box className={styles.page}>
-        <Box sx={{ display: 'flex', justifyContent: 'center', alignItems: 'center', height: '100vh' }}>
+        <Box sx={{ display: "", justifyContent: 'center', alignItems: 'center', height: '100vh' }}>
           <CircularProgress sx={{ color: 'primary.main' }} />
         </Box>

[NoCoverage] StringLiteral
src/App.tsx:58:93
   if (isLoading) {
     return (
       <Box className={styles.page}>
-        <Box sx={{ display: 'flex', justifyContent: 'center', alignItems: 'center', height: '100vh' }}>
+        <Box sx={{ display: 'flex', justifyContent: 'center', alignItems: 'center', height: "" }}>
           <CircularProgress sx={{ color: 'primary.main' }} />
         </Box>
