[NoCoverage] BlockStatement
src/components/HoldCountdown/useHoldCountdown.ts:7:19
 export function useHoldCountdown(expiresAt: string, totalSeconds: number = HOLD_TTL_SECONDS) {
   const [remaining, setRemaining] = useState(0);
 
-  useEffect(() => {
-    const updateCountdown = () => {
-      const expiry = new Date(expiresAt).getTime();
-      const now = Date.now();
-      const diff = expiry - now;
-      setRemaining(Math.max(0, Math.ceil(diff / 1000)));
-    };
-
-    updateCountdown();
-    const interval = setInterval(updateCountdown, 1000);
-    return () => clearInterval(interval);
-  }, [expiresAt]);
+  useEffect(() => {}, [expiresAt]);
 
   const progress = (remaining / totalSeconds) * 100;

[NoCoverage] BlockStatement
src/components/HoldCountdown/useHoldCountdown.ts:8:35
   const [remaining, setRemaining] = useState(0);
 
   useEffect(() => {
-    const updateCountdown = () => {
-      const expiry = new Date(expiresAt).getTime();
-      const now = Date.now();
-      const diff = expiry - now;
-      setRemaining(Math.max(0, Math.ceil(diff / 1000)));
-    };
+    const updateCountdown = () => {};
 
     updateCountdown();

[NoCoverage] ArithmeticOperator
src/components/HoldCountdown/useHoldCountdown.ts:11:20
     const updateCountdown = () => {
       const expiry = new Date(expiresAt).getTime();
       const now = Date.now();
-      const diff = expiry - now;
+      const diff = expiry + now;
       setRemaining(Math.max(0, Math.ceil(diff / 1000)));
     };

[NoCoverage] ArithmeticOperator
src/components/HoldCountdown/useHoldCountdown.ts:12:42
       const expiry = new Date(expiresAt).getTime();
       const now = Date.now();
       const diff = expiry - now;
-      setRemaining(Math.max(0, Math.ceil(diff / 1000)));
+      setRemaining(Math.max(0, Math.ceil(diff * 1000)));
     };
 

[NoCoverage] MethodExpression
src/components/HoldCountdown/useHoldCountdown.ts:12:20
       const expiry = new Date(expiresAt).getTime();
       const now = Date.now();
       const diff = expiry - now;
-      setRemaining(Math.max(0, Math.ceil(diff / 1000)));
+      setRemaining(Math.min(0, Math.ceil(diff / 1000)));
     };
 

[NoCoverage] ArrowFunction
src/components/HoldCountdown/useHoldCountdown.ts:17:12
 
     updateCountdown();
     const interval = setInterval(updateCountdown, 1000);
-    return () => clearInterval(interval);
+    return () => undefined;
   }, [expiresAt]);
 

[NoCoverage] ArithmeticOperator
src/components/HoldCountdown/useHoldCountdown.ts:20:21
     return () => clearInterval(interval);
   }, [expiresAt]);
 
-  const progress = (remaining / totalSeconds) * 100;
+  const progress = (remaining * totalSeconds) * 100;
 
   return { remaining, progress };

[NoCoverage] ArithmeticOperator
src/components/HoldCountdown/useHoldCountdown.ts:20:20
     return () => clearInterval(interval);
   }, [expiresAt]);
 
-  const progress = (remaining / totalSeconds) * 100;
+  const progress = remaining / totalSeconds / 100;
 
   return { remaining, progress };
