[NoCoverage] LogicalOperator
src/components/Seat/Seat.tsx:15:23
 
 export function Seat({ seat, onHold, onRelease, mutationPending, blockNewHold }: SeatProps) {
   const label = `${seat.rowLabel}${seat.seatNumber}`;
-  const heldByOther = seat.status === 'HELD' && !seat.heldByMe;
+  const heldByOther = seat.status === 'HELD' || !seat.heldByMe;
   const reserved = seat.status === 'RESERVED';
   const chosen = seat.status === 'HELD' && seat.heldByMe;

[NoCoverage] ConditionalExpression
src/components/Seat/Seat.tsx:15:23
 
 export function Seat({ seat, onHold, onRelease, mutationPending, blockNewHold }: SeatProps) {
   const label = `${seat.rowLabel}${seat.seatNumber}`;
-  const heldByOther = seat.status === 'HELD' && !seat.heldByMe;
+  const heldByOther = false;
   const reserved = seat.status === 'RESERVED';
   const chosen = seat.status === 'HELD' && seat.heldByMe;

[NoCoverage] ConditionalExpression
src/components/Seat/Seat.tsx:16:20
 export function Seat({ seat, onHold, onRelease, mutationPending, blockNewHold }: SeatProps) {
   const label = `${seat.rowLabel}${seat.seatNumber}`;
   const heldByOther = seat.status === 'HELD' && !seat.heldByMe;
-  const reserved = seat.status === 'RESERVED';
+  const reserved = true;
   const chosen = seat.status === 'HELD' && seat.heldByMe;
   const blockedByCap = seat.status === 'AVAILABLE' && blockNewHold;

[NoCoverage] ConditionalExpression
src/components/Seat/Seat.tsx:16:20
 export function Seat({ seat, onHold, onRelease, mutationPending, blockNewHold }: SeatProps) {
   const label = `${seat.rowLabel}${seat.seatNumber}`;
   const heldByOther = seat.status === 'HELD' && !seat.heldByMe;
-  const reserved = seat.status === 'RESERVED';
+  const reserved = false;
   const chosen = seat.status === 'HELD' && seat.heldByMe;
   const blockedByCap = seat.status === 'AVAILABLE' && blockNewHold;

[NoCoverage] LogicalOperator
src/components/Seat/Seat.tsx:17:18
   const label = `${seat.rowLabel}${seat.seatNumber}`;
   const heldByOther = seat.status === 'HELD' && !seat.heldByMe;
   const reserved = seat.status === 'RESERVED';
-  const chosen = seat.status === 'HELD' && seat.heldByMe;
+  const chosen = seat.status === 'HELD' || seat.heldByMe;
   const blockedByCap = seat.status === 'AVAILABLE' && blockNewHold;
   const disabled = heldByOther || reserved || mutationPending || blockedByCap;

[NoCoverage] ConditionalExpression
src/components/Seat/Seat.tsx:17:18
   const label = `${seat.rowLabel}${seat.seatNumber}`;
   const heldByOther = seat.status === 'HELD' && !seat.heldByMe;
   const reserved = seat.status === 'RESERVED';
-  const chosen = seat.status === 'HELD' && seat.heldByMe;
+  const chosen = false;
   const blockedByCap = seat.status === 'AVAILABLE' && blockNewHold;
   const disabled = heldByOther || reserved || mutationPending || blockedByCap;

[NoCoverage] LogicalOperator
src/components/Seat/Seat.tsx:18:24
   const heldByOther = seat.status === 'HELD' && !seat.heldByMe;
   const reserved = seat.status === 'RESERVED';
   const chosen = seat.status === 'HELD' && seat.heldByMe;
-  const blockedByCap = seat.status === 'AVAILABLE' && blockNewHold;
+  const blockedByCap = seat.status === 'AVAILABLE' || blockNewHold;
   const disabled = heldByOther || reserved || mutationPending || blockedByCap;
 

[NoCoverage] EqualityOperator
src/components/Seat/Seat.tsx:18:24
   const heldByOther = seat.status === 'HELD' && !seat.heldByMe;
   const reserved = seat.status === 'RESERVED';
   const chosen = seat.status === 'HELD' && seat.heldByMe;
-  const blockedByCap = seat.status === 'AVAILABLE' && blockNewHold;
+  const blockedByCap = seat.status !== 'AVAILABLE' && blockNewHold;
   const disabled = heldByOther || reserved || mutationPending || blockedByCap;
 

[NoCoverage] LogicalOperator
src/components/Seat/Seat.tsx:19:20
   const reserved = seat.status === 'RESERVED';
   const chosen = seat.status === 'HELD' && seat.heldByMe;
   const blockedByCap = seat.status === 'AVAILABLE' && blockNewHold;
-  const disabled = heldByOther || reserved || mutationPending || blockedByCap;
+  const disabled = heldByOther && reserved || mutationPending || blockedByCap;
 
   const title = reserved

[NoCoverage] LogicalOperator
src/components/Seat/Seat.tsx:19:20
   const reserved = seat.status === 'RESERVED';
   const chosen = seat.status === 'HELD' && seat.heldByMe;
   const blockedByCap = seat.status === 'AVAILABLE' && blockNewHold;
-  const disabled = heldByOther || reserved || mutationPending || blockedByCap;
+  const disabled = (heldByOther || reserved) && mutationPending || blockedByCap;
 
   const title = reserved

[NoCoverage] StringLiteral
src/components/Seat/Seat.tsx:22:7
   const disabled = heldByOther || reserved || mutationPending || blockedByCap;
 
   const title = reserved
-    ? `${label} · reserved`
+    ? ``
     : heldByOther
       ? `${label} · held by another client`

[NoCoverage] StringLiteral
src/components/Seat/Seat.tsx:24:9
   const title = reserved
     ? `${label} · reserved`
     : heldByOther
-      ? `${label} · held by another client`
+      ? ``
       : blockedByCap
         ? `${label} · seat limit reached`

[NoCoverage] StringLiteral
src/components/Seat/Seat.tsx:26:11
     : heldByOther
       ? `${label} · held by another client`
       : blockedByCap
-        ? `${label} · seat limit reached`
+        ? ``
         : label;
 

[NoCoverage] MethodExpression
src/components/Seat/Seat.tsx:29:21
         ? `${label} · seat limit reached`
         : label;
 
-  const className = [
-    styles.seat,
-    heldByOther && styles.pending,
-    reserved && styles.reserved,
-    chosen && styles.chosen,
-  ]
-    .filter(Boolean)
+  const className = [styles.seat, heldByOther && styles.pending, reserved && styles.reserved, chosen && styles.chosen]
     .join(' ');
 

[NoCoverage] LogicalOperator
src/components/Seat/Seat.tsx:31:5
 
   const className = [
     styles.seat,
-    heldByOther && styles.pending,
+    heldByOther || styles.pending,
     reserved && styles.reserved,
     chosen && styles.chosen,

[NoCoverage] ConditionalExpression
src/components/Seat/Seat.tsx:31:5
 
   const className = [
     styles.seat,
-    heldByOther && styles.pending,
+    true,
     reserved && styles.reserved,
     chosen && styles.chosen,

[NoCoverage] ConditionalExpression
src/components/Seat/Seat.tsx:32:5
   const className = [
     styles.seat,
     heldByOther && styles.pending,
-    reserved && styles.reserved,
+    false,
     chosen && styles.chosen,
   ]

[NoCoverage] ConditionalExpression
src/components/Seat/Seat.tsx:32:5
   const className = [
     styles.seat,
     heldByOther && styles.pending,
-    reserved && styles.reserved,
+    true,
     chosen && styles.chosen,
   ]

[NoCoverage] LogicalOperator
src/components/Seat/Seat.tsx:33:5
     styles.seat,
     heldByOther && styles.pending,
     reserved && styles.reserved,
-    chosen && styles.chosen,
+    chosen || styles.chosen,
   ]
     .filter(Boolean)

[NoCoverage] ConditionalExpression
src/components/Seat/Seat.tsx:33:5
     styles.seat,
     heldByOther && styles.pending,
     reserved && styles.reserved,
-    chosen && styles.chosen,
+    true,
   ]
     .filter(Boolean)

[NoCoverage] BlockStatement
src/components/Seat/Seat.tsx:38:29
     .filter(Boolean)
     .join(' ');
 
-  const handleClick = () => {
-    if (seat.heldByMe) {
-      onRelease(seat.id);
-    } else if (seat.status === 'AVAILABLE') {
-      onHold(seat.id);
-    }
-  };
+  const handleClick = () => {};
 
   return (

[NoCoverage] BlockStatement
src/components/Seat/Seat.tsx:39:24
     .join(' ');
 
   const handleClick = () => {
-    if (seat.heldByMe) {
-      onRelease(seat.id);
-    } else if (seat.status === 'AVAILABLE') {
+    if (seat.heldByMe) {} else if (seat.status === 'AVAILABLE') {
       onHold(seat.id);
     }

[NoCoverage] ConditionalExpression
src/components/Seat/Seat.tsx:39:9
     .join(' ');
 
   const handleClick = () => {
-    if (seat.heldByMe) {
+    if (false) {
       onRelease(seat.id);
     } else if (seat.status === 'AVAILABLE') {

[NoCoverage] ConditionalExpression
src/components/Seat/Seat.tsx:41:16
   const handleClick = () => {
     if (seat.heldByMe) {
       onRelease(seat.id);
-    } else if (seat.status === 'AVAILABLE') {
+    } else if (true) {
       onHold(seat.id);
     }

[NoCoverage] BlockStatement
src/components/Seat/Seat.tsx:41:45
   const handleClick = () => {
     if (seat.heldByMe) {
       onRelease(seat.id);
-    } else if (seat.status === 'AVAILABLE') {
-      onHold(seat.id);
-    }
+    } else if (seat.status === 'AVAILABLE') {}
   };
 
