[Timeout] ConditionalExpression
src/hooks/useSeatStream.ts:6:18
 import type { Seat, SeatHeldPayload, SeatReleasedPayload, SeatReservedPayload } from '../types';
 import { seatsKey } from '../lib/queryKeys';
 
-const BASE_URL = import.meta.env.VITE_API_URL || 'http://localhost:8080/api';
+const BASE_URL = false;
 
 export function useSeatStream() {

[Survived] LogicalOperator
src/hooks/useSeatStream.ts:6:18
 import type { Seat, SeatHeldPayload, SeatReleasedPayload, SeatReservedPayload } from '../types';
 import { seatsKey } from '../lib/queryKeys';
 
-const BASE_URL = import.meta.env.VITE_API_URL || 'http://localhost:8080/api';
+const BASE_URL = import.meta.env.VITE_API_URL && 'http://localhost:8080/api';
 
 export function useSeatStream() {

[Survived] BooleanLiteral
src/hooks/useSeatStream.ts:11:30
 export function useSeatStream() {
   const queryClient = useQueryClient();
   const eventSourceRef = useRef<EventSource | null>(null);
-  const hadErrorRef = useRef(false);
+  const hadErrorRef = useRef(true);
 
   const patchSeat = useCallback(

[Killed] BlockStatement
src/hooks/useSeatStream.ts:14:56
   const hadErrorRef = useRef(false);
 
   const patchSeat = useCallback(
-    (seatId: number, updater: (seat: Seat) => Seat) => {
-      queryClient.setQueryData<Seat[]>(seatsKey, (seats) =>
-        seats?.map((s) => (s.id === seatId ? updater(s) : s))
-      );
-    },
+    (seatId: number, updater: (seat: Seat) => Seat) => {},
     [queryClient]
   );
killedBy: useSeatStream seat-held marks the seat HELD with the payload expiry, without claiming heldByMe
statusReason: expected { id: 1, rowLabel: 'A', …(3) } to match object { status: 'HELD', …(1) }
(4 matching properties omitted from actual)

[Killed] ArrowFunction
src/hooks/useSeatStream.ts:15:50
 
   const patchSeat = useCallback(
     (seatId: number, updater: (seat: Seat) => Seat) => {
-      queryClient.setQueryData<Seat[]>(seatsKey, (seats) =>
-        seats?.map((s) => (s.id === seatId ? updater(s) : s))
+      queryClient.setQueryData<Seat[]>(seatsKey, () => undefined
       );
     },
killedBy: useSeatStream seat-held marks the seat HELD with the payload expiry, without claiming heldByMe
statusReason: expected { id: 1, rowLabel: 'A', …(3) } to match object { status: 'HELD', …(1) }
(4 matching properties omitted from actual)

[Killed] ConditionalExpression
src/hooks/useSeatStream.ts:16:28
   const patchSeat = useCallback(
     (seatId: number, updater: (seat: Seat) => Seat) => {
       queryClient.setQueryData<Seat[]>(seatsKey, (seats) =>
-        seats?.map((s) => (s.id === seatId ? updater(s) : s))
+        seats?.map((s) => (false ? updater(s) : s))
       );
     },
killedBy: useSeatStream seat-held marks the seat HELD with the payload expiry, without claiming heldByMe
statusReason: expected { id: 1, rowLabel: 'A', …(3) } to match object { status: 'HELD', …(1) }
(4 matching properties omitted from actual)

[Killed] EqualityOperator
src/hooks/useSeatStream.ts:16:28
   const patchSeat = useCallback(
     (seatId: number, updater: (seat: Seat) => Seat) => {
       queryClient.setQueryData<Seat[]>(seatsKey, (seats) =>
-        seats?.map((s) => (s.id === seatId ? updater(s) : s))
+        seats?.map((s) => (s.id !== seatId ? updater(s) : s))
       );
     },
killedBy: useSeatStream seat-held marks the seat HELD with the payload expiry, without claiming heldByMe
statusReason: expected { id: 1, rowLabel: 'A', …(3) } to match object { status: 'HELD', …(1) }
(4 matching properties omitted from actual)

[NoCoverage] BlockStatement
src/hooks/useSeatStream.ts:23:33
   );
 
   const setupEventSource = useCallback(() => {
-    if (eventSourceRef.current) {
-      eventSourceRef.current.close();
-    }
+    if (eventSourceRef.current) {}
 
     const eventSource = new EventSource(`${BASE_URL}/seats/stream`);

[Killed] StringLiteral
src/hooks/useSeatStream.ts:27:41
       eventSourceRef.current.close();
     }
 
-    const eventSource = new EventSource(`${BASE_URL}/seats/stream`);
+    const eventSource = new EventSource(``);
     eventSourceRef.current = eventSource;
     hadErrorRef.current = false;
killedBy: useSeatStream opens exactly one EventSource on mount and closes it on unmount
statusReason: expected '' to contain '/seats/stream'

[Killed] BooleanLiteral
src/hooks/useSeatStream.ts:29:27
 
     const eventSource = new EventSource(`${BASE_URL}/seats/stream`);
     eventSourceRef.current = eventSource;
-    hadErrorRef.current = false;
+    hadErrorRef.current = true;
 
     eventSource.addEventListener('seat-held', (event: MessageEvent) => {
killedBy: useSeatStream invalidates the seats query on reconnect (open after a prior error), but not on a clean open
statusReason: expected "invalidateQueries" to not be called at all, but actually been called 1 times

Received: 

  1st invalidateQueries call:

    Array [
      Object {

[Killed] BlockStatement
src/hooks/useSeatStream.ts:31:72
     eventSourceRef.current = eventSource;
     hadErrorRef.current = false;
 
-    eventSource.addEventListener('seat-held', (event: MessageEvent) => {
-      const payload = JSON.parse(event.data) as SeatHeldPayload;
-      // heldByMe is never set from the stream (the payload doesn't carry the holder's
-      // identity — see backend SeatHeldPayload) — only this client's own hold mutation sets it.
-      patchSeat(payload.seatId, (s) => ({ ...s, status: 'HELD', expiresAt: payload.expiresAt }));
-    });
+    eventSource.addEventListener('seat-held', (event: MessageEvent) => {});
 
     eventSource.addEventListener('seat-released', (event: MessageEvent) => {
killedBy: useSeatStream seat-held marks the seat HELD with the payload expiry, without claiming heldByMe
statusReason: expected { id: 1, rowLabel: 'A', …(3) } to match object { status: 'HELD', …(1) }
(4 matching properties omitted from actual)

[Killed] BlockStatement
src/hooks/useSeatStream.ts:38:76
       patchSeat(payload.seatId, (s) => ({ ...s, status: 'HELD', expiresAt: payload.expiresAt }));
     });
 
-    eventSource.addEventListener('seat-released', (event: MessageEvent) => {
-      const payload = JSON.parse(event.data) as SeatReleasedPayload;
-      patchSeat(payload.seatId, (s) => ({ ...s, status: 'AVAILABLE', heldByMe: false, expiresAt: undefined }));
-    });
+    eventSource.addEventListener('seat-released', (event: MessageEvent) => {});
 
     eventSource.addEventListener('seat-reserved', (event: MessageEvent) => {
killedBy: useSeatStream seat-released reverts the seat to AVAILABLE and clears heldByMe/expiresAt
statusReason: expected { id: 1, rowLabel: 'A', …(4) } to match object { status: 'AVAILABLE', …(2) }
(3 matching properties omitted from actual)

[Killed] BooleanLiteral
src/hooks/useSeatStream.ts:40:80
 
     eventSource.addEventListener('seat-released', (event: MessageEvent) => {
       const payload = JSON.parse(event.data) as SeatReleasedPayload;
-      patchSeat(payload.seatId, (s) => ({ ...s, status: 'AVAILABLE', heldByMe: false, expiresAt: undefined }));
+      patchSeat(payload.seatId, (s) => ({ ...s, status: 'AVAILABLE', heldByMe: true, expiresAt: undefined }));
     });
 
killedBy: useSeatStream seat-released reverts the seat to AVAILABLE and clears heldByMe/expiresAt
statusReason: expected { id: 1, rowLabel: 'A', …(4) } to match object { status: 'AVAILABLE', …(2) }
(3 matching properties omitted from actual)

[Killed] BlockStatement
src/hooks/useSeatStream.ts:43:76
       patchSeat(payload.seatId, (s) => ({ ...s, status: 'AVAILABLE', heldByMe: false, expiresAt: undefined }));
     });
 
-    eventSource.addEventListener('seat-reserved', (event: MessageEvent) => {
-      const payload = JSON.parse(event.data) as SeatReservedPayload;
-      patchSeat(payload.seatId, (s) => ({ ...s, status: 'RESERVED', heldByMe: false, expiresAt: undefined }));
-    });
+    eventSource.addEventListener('seat-reserved', (event: MessageEvent) => {});
 
     eventSource.addEventListener('open', () => {
killedBy: useSeatStream seat-reserved marks the seat RESERVED and clears heldByMe/expiresAt
statusReason: expected { id: 1, rowLabel: 'A', …(4) } to match object { status: 'RESERVED', …(2) }
(3 matching properties omitted from actual)

[Killed] StringLiteral
src/hooks/useSeatStream.ts:43:34
       patchSeat(payload.seatId, (s) => ({ ...s, status: 'AVAILABLE', heldByMe: false, expiresAt: undefined }));
     });
 
-    eventSource.addEventListener('seat-reserved', (event: MessageEvent) => {
+    eventSource.addEventListener("", (event: MessageEvent) => {
       const payload = JSON.parse(event.data) as SeatReservedPayload;
       patchSeat(payload.seatId, (s) => ({ ...s, status: 'RESERVED', heldByMe: false, expiresAt: undefined }));
killedBy: useSeatStream seat-reserved marks the seat RESERVED and clears heldByMe/expiresAt
statusReason: expected { id: 1, rowLabel: 'A', …(4) } to match object { status: 'RESERVED', …(2) }
(3 matching properties omitted from actual)

[Killed] BooleanLiteral
src/hooks/useSeatStream.ts:45:79
 
     eventSource.addEventListener('seat-reserved', (event: MessageEvent) => {
       const payload = JSON.parse(event.data) as SeatReservedPayload;
-      patchSeat(payload.seatId, (s) => ({ ...s, status: 'RESERVED', heldByMe: false, expiresAt: undefined }));
+      patchSeat(payload.seatId, (s) => ({ ...s, status: 'RESERVED', heldByMe: true, expiresAt: undefined }));
     });
 
killedBy: useSeatStream seat-reserved marks the seat RESERVED and clears heldByMe/expiresAt
statusReason: expected { id: 1, rowLabel: 'A', …(4) } to match object { status: 'RESERVED', …(2) }
(3 matching properties omitted from actual)

[Killed] BlockStatement
src/hooks/useSeatStream.ts:48:48
       patchSeat(payload.seatId, (s) => ({ ...s, status: 'RESERVED', heldByMe: false, expiresAt: undefined }));
     });
 
-    eventSource.addEventListener('open', () => {
-      if (hadErrorRef.current) {
-        queryClient.invalidateQueries({ queryKey: seatsKey });
-        hadErrorRef.current = false;
-      }
-    });
+    eventSource.addEventListener('open', () => {});
 
     eventSource.addEventListener('error', () => {
killedBy: useSeatStream invalidates the seats query on reconnect (open after a prior error), but not on a clean open
statusReason: expected "invalidateQueries" to be called with arguments: [ { queryKey: [ 'seats' ] } ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/hooks/useSeatStream.ts:49:11
     });
 
     eventSource.addEventListener('open', () => {
-      if (hadErrorRef.current) {
+      if (false) {
         queryClient.invalidateQueries({ queryKey: seatsKey });
         hadErrorRef.current = false;
killedBy: useSeatStream invalidates the seats query on reconnect (open after a prior error), but not on a clean open
statusReason: expected "invalidateQueries" to be called with arguments: [ { queryKey: [ 'seats' ] } ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/hooks/useSeatStream.ts:49:32
     });
 
     eventSource.addEventListener('open', () => {
-      if (hadErrorRef.current) {
-        queryClient.invalidateQueries({ queryKey: seatsKey });
-        hadErrorRef.current = false;
-      }
+      if (hadErrorRef.current) {}
     });
 
killedBy: useSeatStream invalidates the seats query on reconnect (open after a prior error), but not on a clean open
statusReason: expected "invalidateQueries" to be called with arguments: [ { queryKey: [ 'seats' ] } ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
src/hooks/useSeatStream.ts:51:31
     eventSource.addEventListener('open', () => {
       if (hadErrorRef.current) {
         queryClient.invalidateQueries({ queryKey: seatsKey });
-        hadErrorRef.current = false;
+        hadErrorRef.current = true;
       }
     });
killedBy: useSeatStream does not invalidate again on a second open after the error flag was already consumed
statusReason: expected "invalidateQueries" to not be called at all, but actually been called 1 times

Received: 

  1st invalidateQueries call:

    Array [
      Object {

[Killed] BlockStatement
src/hooks/useSeatStream.ts:55:49
       }
     });
 
-    eventSource.addEventListener('error', () => {
-      hadErrorRef.current = true;
-    });
+    eventSource.addEventListener('error', () => {});
   }, [queryClient, patchSeat]);
 
killedBy: useSeatStream invalidates the seats query on reconnect (open after a prior error), but not on a clean open
statusReason: expected "invalidateQueries" to be called with arguments: [ { queryKey: [ 'seats' ] } ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/hooks/useSeatStream.ts:55:34
       }
     });
 
-    eventSource.addEventListener('error', () => {
+    eventSource.addEventListener("", () => {
       hadErrorRef.current = true;
     });
killedBy: useSeatStream invalidates the seats query on reconnect (open after a prior error), but not on a clean open
statusReason: expected "invalidateQueries" to be called with arguments: [ { queryKey: [ 'seats' ] } ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
src/hooks/useSeatStream.ts:56:29
     });
 
     eventSource.addEventListener('error', () => {
-      hadErrorRef.current = true;
+      hadErrorRef.current = false;
     });
   }, [queryClient, patchSeat]);
killedBy: useSeatStream invalidates the seats query on reconnect (open after a prior error), but not on a clean open
statusReason: expected "invalidateQueries" to be called with arguments: [ { queryKey: [ 'seats' ] } ]

Received: 



Number of calls: 0

[Survived] ArrayDeclaration
src/hooks/useSeatStream.ts:58:6
     eventSource.addEventListener('error', () => {
       hadErrorRef.current = true;
     });
-  }, [queryClient, patchSeat]);
+  }, []);
 
   useEffect(() => {

[Killed] BlockStatement
src/hooks/useSeatStream.ts:60:19
     });
   }, [queryClient, patchSeat]);
 
-  useEffect(() => {
-    setupEventSource();
-
-    return () => {
-      if (eventSourceRef.current) {
-        eventSourceRef.current.close();
-      }
-    };
-  }, [setupEventSource]);
+  useEffect(() => {}, [setupEventSource]);
 }
 
killedBy: useSeatStream opens exactly one EventSource on mount and closes it on unmount
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/hooks/useSeatStream.ts:63:18
   useEffect(() => {
     setupEventSource();
 
-    return () => {
-      if (eventSourceRef.current) {
-        eventSourceRef.current.close();
-      }
-    };
+    return () => {};
   }, [setupEventSource]);
 }
killedBy: useSeatStream opens exactly one EventSource on mount and closes it on unmount
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/hooks/useSeatStream.ts:64:35
     setupEventSource();
 
     return () => {
-      if (eventSourceRef.current) {
-        eventSourceRef.current.close();
-      }
+      if (eventSourceRef.current) {}
     };
   }, [setupEventSource]);
killedBy: useSeatStream opens exactly one EventSource on mount and closes it on unmount
statusReason: expected false to be true // Object.is equality
