[Killed] BlockStatement
src/hooks/useHoldSeatMutation.ts:15:38
 
   return useMutation({
     mutationFn: (seatId: number) => holdSeat(seatId),
-    onSuccess: (response, seatId) => {
-      queryClient.setQueryData<Seat[]>(seatsKey, (seats) =>
-        seats?.map((s) =>
-          s.id === seatId ? { ...s, status: 'HELD', heldByMe: true, expiresAt: response.expiresAt } : s
-        )
-      );
-    },
+    onSuccess: (response, seatId) => {},
     onError: (error: Error) => options?.onError?.(error),
   });
killedBy: useHoldSeatMutation marks the held seat as HELD and heldByMe, setting the expiry from the response
statusReason: expected { id: 1, rowLabel: 'A', …(3) } to match object { Object (status, heldByMe, ...) }
(3 matching properties omitted from actual)

[Killed] ArrowFunction
src/hooks/useHoldSeatMutation.ts:16:50
   return useMutation({
     mutationFn: (seatId: number) => holdSeat(seatId),
     onSuccess: (response, seatId) => {
-      queryClient.setQueryData<Seat[]>(seatsKey, (seats) =>
-        seats?.map((s) =>
-          s.id === seatId ? { ...s, status: 'HELD', heldByMe: true, expiresAt: response.expiresAt } : s
-        )
+      queryClient.setQueryData<Seat[]>(seatsKey, () => undefined
       );
     },
killedBy: useHoldSeatMutation marks the held seat as HELD and heldByMe, setting the expiry from the response
statusReason: expected { id: 1, rowLabel: 'A', …(3) } to match object { Object (status, heldByMe, ...) }
(3 matching properties omitted from actual)

[Killed] EqualityOperator
src/hooks/useHoldSeatMutation.ts:18:11
     onSuccess: (response, seatId) => {
       queryClient.setQueryData<Seat[]>(seatsKey, (seats) =>
         seats?.map((s) =>
-          s.id === seatId ? { ...s, status: 'HELD', heldByMe: true, expiresAt: response.expiresAt } : s
+          s.id !== seatId ? { ...s, status: 'HELD', heldByMe: true, expiresAt: response.expiresAt } : s
         )
       );
killedBy: useHoldSeatMutation marks the held seat as HELD and heldByMe, setting the expiry from the response
statusReason: expected { id: 1, rowLabel: 'A', …(3) } to match object { Object (status, heldByMe, ...) }
(3 matching properties omitted from actual)

[Killed] ConditionalExpression
src/hooks/useHoldSeatMutation.ts:18:11
     onSuccess: (response, seatId) => {
       queryClient.setQueryData<Seat[]>(seatsKey, (seats) =>
         seats?.map((s) =>
-          s.id === seatId ? { ...s, status: 'HELD', heldByMe: true, expiresAt: response.expiresAt } : s
+          false ? { ...s, status: 'HELD', heldByMe: true, expiresAt: response.expiresAt } : s
         )
       );
killedBy: useHoldSeatMutation marks the held seat as HELD and heldByMe, setting the expiry from the response
statusReason: expected { id: 1, rowLabel: 'A', …(3) } to match object { Object (status, heldByMe, ...) }
(3 matching properties omitted from actual)

[Killed] ArrowFunction
src/hooks/useHoldSeatMutation.ts:22:14
         )
       );
     },
-    onError: (error: Error) => options?.onError?.(error),
+    onError: () => undefined,
   });
 }
killedBy: useHoldSeatMutation calls onError with the thrown error when the mutation fails
statusReason: expected "spy" to be called with arguments: [ Error: seat taken ]

Received: 



Number of calls: 0
