[Killed] BlockStatement
src/hooks/useReleaseSeatMutation.ts:15:35
 
   return useMutation({
     mutationFn: (seatId: number) => releaseSeat(seatId),
-    onSuccess: (_data, seatId) => {
-      queryClient.setQueryData<Seat[]>(seatsKey, (seats) =>
-        seats?.map((s) => (s.id === seatId ? { ...s, status: 'AVAILABLE', heldByMe: false, expiresAt: undefined } : s))
-      );
-    },
+    onSuccess: (_data, seatId) => {},
     onError: (error: Error) => options?.onError?.(error),
   });
killedBy: useReleaseSeatMutation reverts the released seat to AVAILABLE and clears heldByMe/expiresAt
statusReason: expected { id: 1, rowLabel: 'A', …(4) } to match object { status: 'AVAILABLE', …(2) }
(3 matching properties omitted from actual)

[Killed] ArrowFunction
src/hooks/useReleaseSeatMutation.ts:16:50
   return useMutation({
     mutationFn: (seatId: number) => releaseSeat(seatId),
     onSuccess: (_data, seatId) => {
-      queryClient.setQueryData<Seat[]>(seatsKey, (seats) =>
-        seats?.map((s) => (s.id === seatId ? { ...s, status: 'AVAILABLE', heldByMe: false, expiresAt: undefined } : s))
+      queryClient.setQueryData<Seat[]>(seatsKey, () => undefined
       );
     },
killedBy: useReleaseSeatMutation reverts the released seat to AVAILABLE and clears heldByMe/expiresAt
statusReason: expected { id: 1, rowLabel: 'A', …(4) } to match object { status: 'AVAILABLE', …(2) }
(3 matching properties omitted from actual)

[Killed] BooleanLiteral
src/hooks/useReleaseSeatMutation.ts:17:85
     mutationFn: (seatId: number) => releaseSeat(seatId),
     onSuccess: (_data, seatId) => {
       queryClient.setQueryData<Seat[]>(seatsKey, (seats) =>
-        seats?.map((s) => (s.id === seatId ? { ...s, status: 'AVAILABLE', heldByMe: false, expiresAt: undefined } : s))
+        seats?.map((s) => (s.id === seatId ? { ...s, status: 'AVAILABLE', heldByMe: true, expiresAt: undefined } : s))
       );
     },
killedBy: useReleaseSeatMutation reverts the released seat to AVAILABLE and clears heldByMe/expiresAt
statusReason: expected { id: 1, rowLabel: 'A', …(4) } to match object { status: 'AVAILABLE', …(2) }
(3 matching properties omitted from actual)

[Killed] EqualityOperator
src/hooks/useReleaseSeatMutation.ts:17:28
     mutationFn: (seatId: number) => releaseSeat(seatId),
     onSuccess: (_data, seatId) => {
       queryClient.setQueryData<Seat[]>(seatsKey, (seats) =>
-        seats?.map((s) => (s.id === seatId ? { ...s, status: 'AVAILABLE', heldByMe: false, expiresAt: undefined } : s))
+        seats?.map((s) => (s.id !== seatId ? { ...s, status: 'AVAILABLE', heldByMe: false, expiresAt: undefined } : s))
       );
     },
killedBy: useReleaseSeatMutation reverts the released seat to AVAILABLE and clears heldByMe/expiresAt
statusReason: expected { id: 1, rowLabel: 'A', …(4) } to match object { status: 'AVAILABLE', …(2) }
(3 matching properties omitted from actual)
