[Killed] BlockStatement
src/hooks/useConfirmReservationMutation.ts:14:22
 
   return useMutation({
     mutationFn: (seatIds: number[]) => confirmReservation(seatIds),
-    onSuccess: () => {
-      queryClient.invalidateQueries({ queryKey: seatsKey });
-    },
+    onSuccess: () => {},
     onError: (error: Error) => options?.onError?.(error),
   });
killedBy: useConfirmReservationMutation invalidates the seats query on success
statusReason: expected "invalidateQueries" to be called with arguments: [ { queryKey: [ 'seats' ] } ]

Received: 



Number of calls: 0
