[Killed] ArrowFunction
src/store/useUIStore.ts:11:13
 
 export const useUIStore = create<UIState>((set) => ({
   error: undefined,
-  setError: (message) => set({ error: message }),
+  setError: () => undefined,
   clearError: () => set({ error: undefined }),
 }));
killedBy: useUIStore setError sets the error message
statusReason: expected undefined to be 'Please select at least one seat' // Object.is equality

[Timeout] ArrowFunction
src/store/useUIStore.ts:12:15
 export const useUIStore = create<UIState>((set) => ({
   error: undefined,
   setError: (message) => set({ error: message }),
-  clearError: () => set({ error: undefined }),
+  clearError: () => undefined,
 }));
 
