[NoCoverage] LogicalOperator
src/components/ReservationBar/ReservationBar.tsx:16:41
 }
 
 export function ReservationBar({ seats, onConfirm, loading, error, onDismissError }: ReservationBarProps) {
-  const heldSeats = seats.filter((s) => s.heldByMe && s.status === 'HELD');
+  const heldSeats = seats.filter((s) => s.heldByMe || s.status === 'HELD');
   const canConfirm = heldSeats.length > 0;
 

[NoCoverage] ArrowFunction
src/components/ReservationBar/ReservationBar.tsx:16:34
 }
 
 export function ReservationBar({ seats, onConfirm, loading, error, onDismissError }: ReservationBarProps) {
-  const heldSeats = seats.filter((s) => s.heldByMe && s.status === 'HELD');
+  const heldSeats = seats.filter(() => undefined);
   const canConfirm = heldSeats.length > 0;
 

[NoCoverage] EqualityOperator
src/components/ReservationBar/ReservationBar.tsx:17:22
 
 export function ReservationBar({ seats, onConfirm, loading, error, onDismissError }: ReservationBarProps) {
   const heldSeats = seats.filter((s) => s.heldByMe && s.status === 'HELD');
-  const canConfirm = heldSeats.length > 0;
+  const canConfirm = heldSeats.length <= 0;
 
   const nextExpiry = heldSeats

[NoCoverage] ConditionalExpression
src/components/ReservationBar/ReservationBar.tsx:17:22
 
 export function ReservationBar({ seats, onConfirm, loading, error, onDismissError }: ReservationBarProps) {
   const heldSeats = seats.filter((s) => s.heldByMe && s.status === 'HELD');
-  const canConfirm = heldSeats.length > 0;
+  const canConfirm = false;
 
   const nextExpiry = heldSeats

[NoCoverage] MethodExpression
src/components/ReservationBar/ReservationBar.tsx:19:22
   const heldSeats = seats.filter((s) => s.heldByMe && s.status === 'HELD');
   const canConfirm = heldSeats.length > 0;
 
-  const nextExpiry = heldSeats
-    .map((s) => s.expiresAt)
-    .filter((expiresAt): expiresAt is string => Boolean(expiresAt))
-    .sort()[0];
+  const nextExpiry = heldSeats.map(s => s.expiresAt).filter((expiresAt): expiresAt is string => Boolean(expiresAt))[0];
 
   return (

[NoCoverage] MethodExpression
src/components/ReservationBar/ReservationBar.tsx:19:22
   const heldSeats = seats.filter((s) => s.heldByMe && s.status === 'HELD');
   const canConfirm = heldSeats.length > 0;
 
-  const nextExpiry = heldSeats
-    .map((s) => s.expiresAt)
-    .filter((expiresAt): expiresAt is string => Boolean(expiresAt))
+  const nextExpiry = heldSeats.map(s => s.expiresAt)
     .sort()[0];
 

[NoCoverage] ArrowFunction
src/components/ReservationBar/ReservationBar.tsx:21:13
 
   const nextExpiry = heldSeats
     .map((s) => s.expiresAt)
-    .filter((expiresAt): expiresAt is string => Boolean(expiresAt))
+    .filter(() => undefined)
     .sort()[0];
 

[NoCoverage] EqualityOperator
src/components/ReservationBar/ReservationBar.tsx:32:14
             <strong>
               Selected seats ({heldSeats.length}/{MAX_SEATS_PER_HOLD}):
             </strong>
-            {heldSeats.length > 0 && (
+            {heldSeats.length >= 0 && (
               <span className={styles.seatList}>
                 {heldSeats.map((s) => `${s.rowLabel}${s.seatNumber}`).join(', ')}

[NoCoverage] LogicalOperator
src/components/ReservationBar/ReservationBar.tsx:32:14
             <strong>
               Selected seats ({heldSeats.length}/{MAX_SEATS_PER_HOLD}):
             </strong>
-            {heldSeats.length > 0 && (
-              <span className={styles.seatList}>
-                {heldSeats.map((s) => `${s.rowLabel}${s.seatNumber}`).join(', ')}
-              </span>
-            )}
+            {heldSeats.length > 0 || <span className={styles.seatList}>
+                {heldSeats.map(s => `${s.rowLabel}${s.seatNumber}`).join(', ')}
+              </span>}
           </Box>
           {nextExpiry && <HoldCountdown expiresAt={nextExpiry} />}

[NoCoverage] ArrowFunction
src/components/ReservationBar/ReservationBar.tsx:34:32
             </strong>
             {heldSeats.length > 0 && (
               <span className={styles.seatList}>
-                {heldSeats.map((s) => `${s.rowLabel}${s.seatNumber}`).join(', ')}
+                {heldSeats.map(() => undefined).join(', ')}
               </span>
             )}

[NoCoverage] StringLiteral
src/components/ReservationBar/ReservationBar.tsx:34:39
             </strong>
             {heldSeats.length > 0 && (
               <span className={styles.seatList}>
-                {heldSeats.map((s) => `${s.rowLabel}${s.seatNumber}`).join(', ')}
+                {heldSeats.map((s) => ``).join(', ')}
               </span>
             )}

[NoCoverage] ConditionalExpression
src/components/ReservationBar/ReservationBar.tsx:38:12
               </span>
             )}
           </Box>
-          {nextExpiry && <HoldCountdown expiresAt={nextExpiry} />}
+          {false}
           <Button
             variant="contained"

[NoCoverage] ConditionalExpression
src/components/ReservationBar/ReservationBar.tsx:38:12
               </span>
             )}
           </Box>
-          {nextExpiry && <HoldCountdown expiresAt={nextExpiry} />}
+          {true}
           <Button
             variant="contained"

[NoCoverage] BooleanLiteral
src/components/ReservationBar/ReservationBar.tsx:43:23
             variant="contained"
             color="primary"
             onClick={onConfirm}
-            disabled={!canConfirm || loading}
+            disabled={canConfirm || loading}
             className={styles.confirmButton}
           >

[NoCoverage] ConditionalExpression
src/components/ReservationBar/ReservationBar.tsx:43:23
             variant="contained"
             color="primary"
             onClick={onConfirm}
-            disabled={!canConfirm || loading}
+            disabled={false}
             className={styles.confirmButton}
           >

[NoCoverage] BooleanLiteral
src/components/ReservationBar/ReservationBar.tsx:50:24
           </Button>
         </Toolbar>
       </Box>
-      <Snackbar open={!!error} autoHideDuration={6000} onClose={onDismissError}>
+      <Snackbar open={!error} autoHideDuration={6000} onClose={onDismissError}>
         <Alert onClose={onDismissError} severity="error" className={styles.alert}>
           {error}
