[Killed] StringLiteral
src/lib/api.ts:5:19
 import { http } from './http';
 
 export async function getSeatMap(): Promise<Seat[]> {
-  return http.get(`/seats`);
+  return http.get(``);
 }
 
killedBy: api getSeatMap fetches from /seats
statusReason: expected "spy" to be called with arguments: [ '/seats' ]

Received: 

  1st spy call:

  Array [
-   "/seats",

[Killed] BlockStatement
src/lib/api.ts:12:66
   return http.post(`/seats/${seatId}/hold`);
 }
 
-export async function releaseSeat(seatId: number): Promise<void> {
-  await http.del(`/seats/${seatId}/hold`);
-}
+export async function releaseSeat(seatId: number): Promise<void> {}
 
 export async function confirmReservation(seatIds: number[]): Promise<Reservation> {
killedBy: api releaseSeat deletes /seats/:id/hold
statusReason: expected "spy" to be called with arguments: [ '/seats/5/hold' ]

Received: 



Number of calls: 0
