[Killed] ConditionalExpression
src/lib/clientId.ts:5:7
 
 export function getOrCreateClientId(): string {
   let clientId = localStorage.getItem(CLIENT_ID_KEY);
-  if (!clientId) {
+  if (true) {
     clientId = crypto.randomUUID();
     localStorage.setItem(CLIENT_ID_KEY, clientId);
killedBy: getOrCreateClientId returns the existing id instead of generating a new one
statusReason: expected 'e6f32d47-1007-4073-a05b-f962171ac66c' to be 'existing-id' // Object.is equality
