[Survived] LogicalOperator
src/lib/http.ts:18:20
   private defaultHeaders?: Record<string, string>
 
   constructor() {
-    this.baseUrl = import.meta.env.VITE_API_URL || 'http://localhost:8080/api'
+    this.baseUrl = import.meta.env.VITE_API_URL && 'http://localhost:8080/api'
   }
 

[NoCoverage] ConditionalExpression
src/lib/http.ts:22:9
   }
 
   private getDefaultHeaders(): Record<string, string> {
-    if (!this.defaultHeaders) {
+    if (true) {
       const clientId = getOrCreateClientId()
       this.defaultHeaders = {

[NoCoverage] StringLiteral
src/lib/http.ts:26:25
       const clientId = getOrCreateClientId()
       this.defaultHeaders = {
         'X-Client-Id': clientId,
-        'Content-Type': 'application/json',
+        'Content-Type': "",
       }
     }

[NoCoverage] ObjectLiteral
src/lib/http.ts:35:16
   private async request<T>(url: string, options?: FetchOptions): Promise<T> {
     const response = await fetch(url, {
       ...options,
-      headers: {
-        ...this.getDefaultHeaders(),
-        ...options?.headers,
-      },
+      headers: {},
     })
 

[NoCoverage] LogicalOperator
src/lib/http.ts:43:23
 
     if (!response.ok) {
       const text = await response.text()
-      throw new Error(parseErrorMessage(text) || `HTTP ${response.status}`)
+      throw new Error(parseErrorMessage(text) && `HTTP ${response.status}`)
     }
 

[NoCoverage] EqualityOperator
src/lib/http.ts:46:9
       throw new Error(parseErrorMessage(text) || `HTTP ${response.status}`)
     }
 
-    if (response.status === 204) {
+    if (response.status !== 204) {
       return undefined as T
     }

[NoCoverage] BlockStatement
src/lib/http.ts:46:34
       throw new Error(parseErrorMessage(text) || `HTTP ${response.status}`)
     }
 
-    if (response.status === 204) {
-      return undefined as T
-    }
+    if (response.status === 204) {}
 
     const text = await response.text()

[NoCoverage] StringLiteral
src/lib/http.ts:59:28
   }
 
   async post<T>(path: string, body?: unknown): Promise<T> {
-    return this.request<T>(`${this.baseUrl}${path}`, {
+    return this.request<T>(``, {
       method: 'POST',
       body: body ? JSON.stringify(body) : undefined,

[NoCoverage] BlockStatement
src/lib/http.ts:65:42
     })
   }
 
-  async del(path: string): Promise<void> {
-    await this.request<void>(`${this.baseUrl}${path}`, {
-      method: 'DELETE',
-    })
-  }
+  async del(path: string): Promise<void> {}
 }
 

[NoCoverage] BooleanLiteral
src/lib/http.ts:73:7
 }
 
 function parseErrorMessage(text: string): string | undefined {
-  if (!text) {
+  if (text) {
     return undefined
   }

[NoCoverage] ConditionalExpression
src/lib/http.ts:73:7
 }
 
 function parseErrorMessage(text: string): string | undefined {
-  if (!text) {
+  if (false) {
     return undefined
   }

[NoCoverage] BlockStatement
src/lib/http.ts:76:7
   if (!text) {
     return undefined
   }
-  try {
-    const parsed = JSON.parse(text) as ErrorResponse
-    return parsed.message
-  } catch {
+  try {} catch {
     return text
   }

[NoCoverage] BlockStatement
src/lib/http.ts:79:11
   try {
     const parsed = JSON.parse(text) as ErrorResponse
     return parsed.message
-  } catch {
-    return text
-  }
+  } catch {}
 }
 
