[NoCoverage] StringLiteral
src/components/SeatMap/SeatMap.tsx:17:12
 }
 
 const LEGEND = [
-  { label: 'Available', swatchClass: styles.swatchAvailable },
+  { label: "", swatchClass: styles.swatchAvailable },
   { label: 'Selected', swatchClass: styles.swatchSelected },
   { label: 'Held by other', swatchClass: styles.swatchPending },

[NoCoverage] ObjectLiteral
src/components/SeatMap/SeatMap.tsx:20:3
   { label: 'Available', swatchClass: styles.swatchAvailable },
   { label: 'Selected', swatchClass: styles.swatchSelected },
   { label: 'Held by other', swatchClass: styles.swatchPending },
-  { label: 'Reserved', swatchClass: styles.swatchReserved },
+  {},
 ];
 

[NoCoverage] StringLiteral
src/components/SeatMap/SeatMap.tsx:20:12
   { label: 'Available', swatchClass: styles.swatchAvailable },
   { label: 'Selected', swatchClass: styles.swatchSelected },
   { label: 'Held by other', swatchClass: styles.swatchPending },
-  { label: 'Reserved', swatchClass: styles.swatchReserved },
+  { label: "", swatchClass: styles.swatchReserved },
 ];
 

[NoCoverage] BlockStatement
src/components/SeatMap/SeatMap.tsx:26:32
 export function SeatMap({ seats, onHold, onRelease, pendingSeatId, maxSeatsReached }: SeatMapProps) {
   const rows = useMemo(() => {
     const grouped = seats.reduce((acc, seat) => {
-      if (!acc[seat.rowLabel]) {
-        acc[seat.rowLabel] = [];
-      }
+      if (!acc[seat.rowLabel]) {}
       acc[seat.rowLabel].push(seat);
       return acc;

[NoCoverage] BooleanLiteral
src/components/SeatMap/SeatMap.tsx:26:11
 export function SeatMap({ seats, onHold, onRelease, pendingSeatId, maxSeatsReached }: SeatMapProps) {
   const rows = useMemo(() => {
     const grouped = seats.reduce((acc, seat) => {
-      if (!acc[seat.rowLabel]) {
+      if (acc[seat.rowLabel]) {
         acc[seat.rowLabel] = [];
       }

[NoCoverage] MethodExpression
src/components/SeatMap/SeatMap.tsx:33:12
       return acc;
     }, {} as Record<string, SeatType[]>);
 
-    return Object.keys(grouped)
-      .sort()
+    return Object.keys(grouped)
       .map((row) => ({
         row,

[NoCoverage] ArithmeticOperator
src/components/SeatMap/SeatMap.tsx:37:49
       .sort()
       .map((row) => ({
         row,
-        seats: [...grouped[row]].sort((a, b) => parseInt(a.seatNumber, 10) - parseInt(b.seatNumber, 10)),
+        seats: [...grouped[row]].sort((a, b) => parseInt(a.seatNumber, 10) + parseInt(b.seatNumber, 10)),
       }));
   }, [seats]);

[NoCoverage] MethodExpression
src/components/SeatMap/SeatMap.tsx:37:16
       .sort()
       .map((row) => ({
         row,
-        seats: [...grouped[row]].sort((a, b) => parseInt(a.seatNumber, 10) - parseInt(b.seatNumber, 10)),
+        seats: [...grouped[row]],
       }));
   }, [seats]);

[NoCoverage] ArrowFunction
src/components/SeatMap/SeatMap.tsx:52:21
         <Box className={styles.screenBar}>STAGE</Box>
 
         <Box className={styles.seatMapWrap}>
-          {rows.map(({ row, seats: rowSeats }) => (
-            <Box key={row} className={styles.rowBlock}>
-              <Typography component="span" className={styles.rowLabel}>
-                {row}
-              </Typography>
-              <Grid container spacing={1} className={styles.rowSeats}>
-                {rowSeats.map((seat) => (
-                  <Grid key={seat.id}>
-                    <Seat
-                      seat={seat}
-                      onHold={onHold}
-                      onRelease={onRelease}
-                      mutationPending={seat.id === pendingSeatId}
-                      blockNewHold={maxSeatsReached}
-                    />
-                  </Grid>
-                ))}
-              </Grid>
-            </Box>
-          ))}
+          {rows.map(() => undefined)}
         </Box>
       </Box>

[NoCoverage] ArrowFunction
src/components/SeatMap/SeatMap.tsx:58:31
                 {row}
               </Typography>
               <Grid container spacing={1} className={styles.rowSeats}>
-                {rowSeats.map((seat) => (
-                  <Grid key={seat.id}>
-                    <Seat
-                      seat={seat}
-                      onHold={onHold}
-                      onRelease={onRelease}
-                      mutationPending={seat.id === pendingSeatId}
-                      blockNewHold={maxSeatsReached}
-                    />
-                  </Grid>
-                ))}
+                {rowSeats.map(() => undefined)}
               </Grid>
             </Box>

[NoCoverage] EqualityOperator
src/components/SeatMap/SeatMap.tsx:64:40
                       seat={seat}
                       onHold={onHold}
                       onRelease={onRelease}
-                      mutationPending={seat.id === pendingSeatId}
+                      mutationPending={seat.id !== pendingSeatId}
                       blockNewHold={maxSeatsReached}
                     />

[NoCoverage] ConditionalExpression
src/components/SeatMap/SeatMap.tsx:64:40
                       seat={seat}
                       onHold={onHold}
                       onRelease={onRelease}
-                      mutationPending={seat.id === pendingSeatId}
+                      mutationPending={true}
                       blockNewHold={maxSeatsReached}
                     />

[NoCoverage] ArrowFunction
src/components/SeatMap/SeatMap.tsx:76:21
       </Box>
 
       <Box className={styles.legend}>
-        {LEGEND.map((li) => (
-          <Box key={li.label} className={styles.legendItem}>
-            <span className={`${styles.swatch} ${li.swatchClass}`} />
-            {li.label}
-          </Box>
-        ))}
+        {LEGEND.map(() => undefined)}
       </Box>
     </Box>
